---
type: DockablePaneProviderData
namespace: Autodesk.Revit.UI
version: 2024
members: 8
tags: [revit-api, class]
---

# DockablePaneProviderData

`Autodesk.Revit.UI.DockablePaneProviderData` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | DockablePaneProviderData | — | `public DockablePaneProviderData ()` |
| Method | GetFrameworkElement | 2018 | `public FrameworkElement GetFrameworkElement ()` |
| Property | ContextualHelp | 2016 | `public ContextualHelp ContextualHelp { get ; set ; }` |
| Property | EditorInteraction | 2017 | `public EditorInteraction EditorInteraction { get ; set ; }` |
| Property | FrameworkElement | 2014 | `public FrameworkElement FrameworkElement { get ; set ; }` |
| Property | FrameworkElementCreator | 2018 | `public IFrameworkElementCreator FrameworkElementCreator { get ; set ; }` |
| Property | InitialState | 2014 | `public DockablePaneState InitialState { get ; set ; }` |
| Property | VisibleByDefault | 2017 | `public bool VisibleByDefault { get ; set ; }` |